In [1]:
import sys

In [2]:
sys.path.append('/scratch/pradap/python-work/anhaidgroup/magellan/')

In [3]:
import magellan as mg

In [4]:
from magellan.feature.tokenizers import get_single_arg_tokenizers, get_tokenizers_for_blocking, get_tokenizers_for_matching

In [5]:
A = mg.load_dataset('table_A', key='ID')
B = mg.load_dataset('table_B', key='ID')

In [6]:
F = mg.get_features_for_matching(A, B)
F.set_index('feature_name', inplace=True)

WARNING:magellan.feature.autofeaturegen:Magellan types: address type (str_bt_1w_5w) and address type (str_bt_5w_10w) are different.If you want to set them to be same and generate features, update output from get_attr_types and use get_features command.

In [13]:
mg._match_c['ltable']

,ID,name,birth_year,hourly_wage,address,zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122

In [8]:
for f in F['function']:
    print(f(A.ix[1], B.ix[2]))

2
0
0
0
1.0
0.388888888889
0.5
0.333333333333
0.823931623932
4
9.0
9.0
1
1.0
0.0
1
1.0
0.0
1
1.0
0.0

In [14]:
mg._atypes1['_table']

,ID,name,birth_year,hourly_wage,address,zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122

In [16]:
len(A.columns)

6

In [17]:
A.insert(len(A.columns), 'label', [0]*len(A))

In [18]:
A

,ID,name,birth_year,hourly_wage,address,zipcode,label
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107,0
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122,0
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107,0
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122,0
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122,0